var districts = [
    {'东城': ['安贞', '北京南站', '朝阳门外', '朝阳门内', '崇文门', '东单', '东直门', '地安门', '东花市', '东四', '灯市口', '国展', '广渠门', '工体', '惠新西街', '和平里', '交道口', '劲松', '建国门外', '建国门内', '金宝街', '六铺炕', '木樨园', '蒲黄榆', '前门', '双井', '陶然亭', '天坛', '西四', '西罗园', '西单', '永定门', '洋桥', '左安门']
},
    {'西城': ['菜户营', '长椿街', '崇文门', '车公庄', '地安门', '德胜门', '阜成门', '广安门', '官园', '金融街', '六铺炕', '马甸', '马连道', '木樨地', '牛街', '陶然亭', '太平桥', '天宁寺', '西四', '小西天', '宣武门', '西直门', '新街口', '西单', '月坛', '右安门内']
},
    {'海淀': ['奥林匹克公园', '白石桥', '北太平庄', '厂洼', '定慧寺', '二里庄', '公主坟', '甘家口', '海淀其它', '海淀北部新区', '军博', '六里桥', '老山', '马甸', '牡丹园', '马连洼', '木樨地', '清河', '苏州桥', '世纪城', '四季青', '双榆树', '上地', '田村', '万寿路', '魏公村', '五棵松', '万柳', '五道口', '小西天', '西北旺', '新街口', '西直门', '西三旗', '西山', '学院路', '西二旗', '颐和园', '玉泉路', '杨庄', '圆明园', '皂君庙', '紫竹桥', '中关村', '知春路']
},
    {'丰台': ['北大地', '成寿寺', '草桥', '菜户营', '大红门', '丰台其它', '方庄', '广安门', '和义', '花乡', '旧宫', '角门', '科技园区', '看丹桥', '六里桥', '刘家窑', '丽泽', '卢沟桥', '马连道', '马家堡', '木樨园', '蒲黄榆', '七里庄', '青塔', '十里河', '宋家庄', '太平桥', '五里店', '五棵松', '西红门', '西罗园', '新宫', '洋桥', '玉泉营', '岳各庄', '右安门外', '赵公口']
},
    {'石景山': ['城子', '古城', '老山', '鲁谷', '苹果园', '石景山其它', '杨庄', '玉泉路']
},
    {'通州': ['果园', '管庄', '九棵树(家乐福)', '潞苑', '梨园', '临河里', '马驹桥', '乔庄', '首都机场', '通州北苑', '通州其它', '武夷花园', '新华大街', '亦庄', '玉桥']
},
    {'昌平': ['奥林匹克公园', '百善镇', '北七家', '昌平其它', '东关', '鼓楼大街', '回龙观', '海淀北部新区', '霍营', '立水桥', '南口', '南邵', '沙河', '天通苑', '西关环岛', '西三旗', '小汤山']
},
    {'大兴': ['观音寺', '黄村火车站', '黄村北', '黄村中', '和义', '旧宫', '科技园区', '十八里店', '天宫院', '西红门', '亦庄', '枣园']
},
    {'亦庄': '亦庄其他'
},
    {'顺义': ['后沙峪', '李桥', '马坡', '顺义城', '顺义其它', '首都机场', '天竺', '中央别墅区']
},
    {'房山': ['长阳', '窦店', '房山其它', '韩村河', '良乡', '琉璃河', '阎村', '燕山']
},
    {'门头沟': ['城子', '大峪', '冯村', '门头沟其它', '石门营']
},
    {'平谷': '平谷其他'
},
    {'怀柔': ['怀柔其它']
},
    {'密云': '密云其他'
},
    {'延庆': '延庆其他'
}, 
    {'燕郊': '燕郊其他'
}] 
